#Область СлужебныйПрограммныйИнтерфейс

Функция СформироватьJSON(Данные, ОшибкаФормированияJSON, Сообщение = "") Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	СообщениеОбОшибке = "";
	ОшибкаФормированияJSON = Ложь;
	
	СтруктураОтвета = ПолучитьСтандартнуюСтруктуруОтвета();
	СтруктураОтвета.data = Данные;
	СтруктураОтвета.message = Сообщение;
	
	Попытка
		ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета);
	Исключение
		
		ОшибкаФормированияJSON = Истина;
		СообщениеОбОшибке = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Если СообщениеОбОшибке <> "" Тогда
		СтрокаJSON = СформироватьJSONСОшибкой(СообщениеОбОшибке);
	КонецЕсли;
	
	Возврат СтрокаJSON;
	
КонецФункции

Функция СформироватьJSONСОшибкой(СообщениеОбОшибке) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	СтруктураОтвета = ПолучитьСтандартнуюСтруктуруОтвета();
	СтруктураОтвета.success = Ложь;
	СтруктураОтвета.message = СообщениеОбОшибке;
	
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета);
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;
	
КонецФункции

Функция JSONВДанные1С(СтрокаJSON) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	ДанныеОбъекта = ПрочитатьJSON(ЧтениеJSON);
	
	Возврат ДанныеОбъекта;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСтандартнуюСтруктуруОтвета()
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("success", Истина);
	СтруктураОтвета.Вставить("message", "");
	СтруктураОтвета.Вставить("data", Неопределено);
	
	Возврат СтруктураОтвета;
	
КонецФункции

#КонецОбласти