Функция ПолучениеСпискаНоменклатурGET(Запрос)
	
	ДанныеНоменклатур = Dev_ФормированиеИОбработкаДанныхДляHTTPСервисов.СформироватьСписокНоменклатур();
	
	ОшибкаФормированияJSON = Ложь;
	СтрокаJSON = Dev_РаботаСJSON.СформироватьJSON(ДанныеНоменклатур, ОшибкаФормированияJSON);
	
	КодОтвета = 200;
	
	Если ОшибкаФормированияJSON Тогда
		КодОтвета = 400;
	КонецЕсли;
	
	Возврат Dev_РаботаСHTTPСервисами.СформироватьОтветHTTPСервиса(КодОтвета, СтрокаJSON);
	
КонецФункции

Функция ИзменениеРеквизитаНоменклатурыPATCH(Запрос)
	
	ВходныеДанныеСтрока = Запрос.ПолучитьТелоКакСтроку();
	
	Если ПустаяСтрока(ВходныеДанныеСтрока) Тогда
		
		СтрокаJSON = Dev_РаботаСJSON.СформироватьJSONСОшибкой("Пустое тело запроса");
		
		Возврат Dev_РаботаСHTTPСервисами.СформироватьОтветHTTPСервиса(400, СтрокаJSON);
		
	КонецЕсли;
	
	Попытка
		ДанныеЗапроса = Dev_РаботаСJSON.JSONВДанные1С(ВходныеДанныеСтрока);
	Исключение
		
		СтрокаJSON = Dev_РаботаСJSON.СформироватьJSONСОшибкой("Невалидный JSON");
		
		Возврат Dev_РаботаСHTTPСервисами.СформироватьОтветHTTPСервиса(400, СтрокаJSON);
		
	КонецПопытки;
	
	Если ДанныеЗапроса.Свойство("products") И ТипЗнч(ДанныеЗапроса["products"]) = Тип("Массив") Тогда
		
		Сообщение = "";
		МассивНезаписанныхНоменклатур = Новый Массив;
		ОшибкаФормированияJSON = Ложь;
		КодОтвета = 200;
		
		МассивИзмененийНоменклатур = ДанныеЗапроса["products"];
		
		Dev_ФормированиеИОбработкаДанныхДляHTTPСервисов.ОбработатьСписокИзмененийВНоменклатурах(
			МассивИзмененийНоменклатур, Сообщение, МассивНезаписанныхНоменклатур);
			
		Если Сообщение <> "" Тогда
			
			КодОтвета = 207;
			
			Если МассивИзмененийНоменклатур.Количество() = 1 Тогда
				КодОтвета = 422;
			КонецЕсли;
			
		КонецЕсли;
			
		СтрокаJSON = Dev_РаботаСJSON.СформироватьJSON(МассивНезаписанныхНоменклатур, ОшибкаФормированияJSON, Сообщение);
		
		Если ОшибкаФормированияJSON Тогда
			КодОтвета = 500;
		КонецЕсли;
		
		Возврат Dev_РаботаСHTTPСервисами.СформироватьОтветHTTPСервиса(КодОтвета, СтрокаJSON);
		
	Иначе
		
		СтрокаJSON = Dev_РаботаСJSON.СформироватьJSONСОшибкой("В теле запроса отсутствует массив 'products'");
		
		Возврат Dev_РаботаСHTTPСервисами.СформироватьОтветHTTPСервиса(400, СтрокаJSON);

	КонецЕсли;
	
КонецФункции
