#Область СлужебныйПрограммныйИнтерфейс

Функция СформироватьСписокНоменклатур() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Наименование КАК name
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураЭлемента = Новый Структура("id, name");
		СтруктураЭлемента.id = Строка(Выборка.Ссылка.УникальныйИдентификатор());
		СтруктураЭлемента.name = Выборка.name;
		
		МассивЭлементов.Добавить(СтруктураЭлемента);
		
	КонецЦикла;
	
	Возврат МассивЭлементов;
	
КонецФункции

Процедура ОбработатьСписокИзмененийВНоменклатурах(МассивИзмененныхНоменклатур, Сообщение, МассивНезаписанныхНоменклатур) Экспорт
	
	СтруктураСоответствий = СоответствиеНаименованийНессылочныхРеквизитовНаАнглийскомКРусскому();
	
	Для Каждого СтруктураЭлементаМассива Из МассивИзмененныхНоменклатур Цикл
		
		Если ТипЗнч(СтруктураЭлементаМассива) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ СтруктураЭлементаМассива.Свойство("id") Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураДанныхДляИзмененияНаРусском = Новый Структура;
		
		Для Каждого ЭлементСтруктуры Из СтруктураЭлементаМассива Цикл
			
			Если НЕ СтруктураСоответствий.Свойство(ЭлементСтруктуры.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураДанныхДляИзмененияНаРусском.Вставить(СтруктураСоответствий[ЭлементСтруктуры.Ключ], ЭлементСтруктуры.Значение);
			
		КонецЦикла;
		
		НовыйГуид = Новый УникальныйИдентификатор(СтруктураЭлементаМассива["id"]);
		СсылкаНаНоменклатуру = Справочники.Номенклатура.ПолучитьСсылку(НовыйГуид);
		
		Если ОбщегоНазначения.СсылкаСуществует(СсылкаНаНоменклатуру) Тогда
			
			ОбъектНоменклатуры = СсылкаНаНоменклатуру.ПолучитьОбъект();
			ЗаполнитьЗначенияСвойств(ОбъектНоменклатуры, СтруктураДанныхДляИзмененияНаРусском);
			
			Попытка
				ОбъектНоменклатуры.Записать();
			Исключение
				МассивНезаписанныхНоменклатур.Добавить(СтруктураЭлементаМассива["id"]);
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивНезаписанныхНоменклатур.Количество() > 0 Тогда
		Сообщение = "Некоторые номенклатуры были не записаны из-за неправильно заполненных реквизитов";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоответствиеНаименованийНессылочныхРеквизитовНаАнглийскомКРусскому()
	
	СтруктураЗначений = Новый Структура;
	СтруктураЗначений.Вставить("name", "Наименование");
	
	Возврат СтруктураЗначений;
	
КонецФункции

#КонецОбласти