
Функция РаботаСПродуктамиПолучитьДанныеНоменклатуры(Запрос)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Номенклатура.Ссылка)) КАК id,
	|	Номенклатура.Наименование КАК name
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураЭлемента = Новый Структура("id, name");
		ЗаполнитьЗначенияСвойств(СтруктураЭлемента, Выборка);
		МассивЭлементов.Добавить(СтруктураЭлемента);
		
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МассивЭлементов);
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json");	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	
	Возврат Ответ;
	
КонецФункции
